Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method (String, Point)
 Queries the user to pick point with given prompt and reference to another point.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point PickPoint(
	string Prompt,
	Point ReferencePoint
)
Public Function PickPoint (
	Prompt As String,
	ReferencePoint As Point
) As Point
Parameters
Prompt
Type: System.String
The string to display as user guidance.
ReferencePoint
Type: Tekla.Structures.Geometry3d.Point
The point to be used as reference.
Return Value
Type: Point
The point the user picked.
See Also
Reference
Picker Class
PickPoint Overload
Tekla.Structures.Model.UI Namespace